# **`switch` 语句**
按照整数参数的值执行代码。
在需要按照整数值执行多个分支的一个或数个之处使用。

## **语法**
```c
属性说明符序列1 switch ( 表达式 ) 语句
    属性说明符序列2 case 常量表达式 : 语句 
    属性说明符序列2 default : 语句
```
`属性说明符序列1` 是可选的属性列表，会应用到 `switch` 语句。

`表达式` 任何整数类型（ `char`，有符号或无符号整数或枚举类型 ）表达式

`语句` 可以是任何语句（典型的语句为复合语句）。允许在 `语句` 中有 `case:` 和 `default:` 标号，而 `break;` 语句拥有特殊的含义。

`属性说明符序列2` 是可选的属性列表，会应用到标号。

`常量表达式` 可以是任何整数常量表达式。

## **解释**
`switch` 语句体可以拥有任意数量的 `case` 语句，只要所有表达式均为独有（在转换到 `表达式` 的 *提升后类型* 后）。最多只能存在一个 `default:` 标号（尽管嵌套的 `switch` 语句可使用其自身的 `default:` 标号，或拥有常量等于外围 `switch` 所用的 `case:` 标号）。
```c
/*************************************************************************
	> File Name: 2-2-1.c
	> Author: DoItYsf
	> Mail: javathon@hotmail.com
	> Created Time: 2022年01月07日 星期五 15时57分21秒
 ************************************************************************/

#include<stdio.h>

int main(){
    puts("switch A:");
    switch(1){
        case 1: puts("\t1");
        case 2: puts("\t2");
    }
    puts("switch B:");
    switch(1){
        case 1: puts("\t1");
                break;
        case 2: puts("\t2");
                break;
    }
    puts("switch C:");
    switch(3){
        case 1: puts("\t1");
                break;
        case 2: puts("\t2");
                break;
        default :
                puts("\t3");
    }
    return 0;
}
```
编译指令：
```shell
gcc 2-2-1.c -o 2-2-1
```
执行结果：
```shell
> ./2-2-1
switch A:
        1
        2
switch B:
        1
switch C:
        3
```
和所有选择和迭代语句一样， `switch` 语句建立块作用域：任何 `表达式` 的标识符在 `语句` 后离开作用域。

若 `case:` 或 `default:` 标号在 VLA （变长数组）或另一拥有可变修改类型的标识符的作用域内，则整个 `switch`语句必须在其作用域内。也就是说 VAL 必须在整个 `switch` 前或最后的标号后声明。
```c
/*************************************************************************
	> File Name: 2-2-2.c
	> Author: DoItYsf
	> Mail: javathon@hotmail.com
	> Created Time: 2022年01月07日 星期五 15时59分15秒
 ************************************************************************/

#include<stdio.h>
void f(int x){
    printf("f():%d",x);
}
int main(){
    int a = 0;
    switch(a){
        int i = 4;
        f(i);
        int b[i];
        case 0:
            i = 8;
        default:;
    }
    return 0;
}
```
编译指令：
```
gcc 2-2-2.c -o 2-2-2
```
报错：
```
2-2-2.c: In function ‘main’:
2-2-2.c:18:9: error: switch jumps into scope of identifier with variably modified type
   18 |         case 0:
      |         ^~~~
2-2-2.c:14:5: note: switch starts here
   14 |     switch(a){
      |     ^~~~~~
2-2-2.c:17:13: note: ‘b’ declared here
   17 |         int b[i];
      |             ^
2-2-2.c:20:9: error: switch jumps into scope of identifier with variably modified type
   20 |         default:;
      |         ^~~~~~~
2-2-2.c:14:5: note: switch starts here
   14 |     switch(a){
      |     ^~~~~~
2-2-2.c:17:13: note: ‘b’ declared here
   17 |         int b[i];
      |             ^
2-2-2.c:14:14: warning: statement will never be executed [-Wswitch-unreachable]
   14 |     switch(a){
      |              ^
```
    2-2-2.c 中第17行处的 VAL 声明出现在了 switch 块作用域内，且在标号声明前，因此报错。
```c
/*************************************************************************
	> File Name: 2-2-3.c
	> Author: DoItYsf
	> Mail: javathon@hotmail.com
	> Created Time: 2022年01月07日 星期五 15时59分50秒
 ************************************************************************/

#include<stdio.h>
int main(){
    int a = 0;
    switch(a){
        int i = 4;
        case 0:
            printf("case 0 : i = %d\n",i);
            i = 8;
        default:;
        printf("after default: i = %d\n",i);
    }
    return 0;
}
```
编译指令：
```shell
gcc 2-2-3.c -o 2-2-3 -w
```
执行结果：
```shell
> ./2-2-3
case 0 : i = 0
after default: i = 8
```
